app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries" ORDER BY date ASC
---
  def index
    @entries = Entry.all.order('date ASC')

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @entry = Entry.find params[:id]

INSERT INTO "entries" ("title", "contents", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "t"], ["contents", "fef"], ["created_at", "2017-05-20 15:27:39.752308"], ["updated_at", "2017-05-20 15:27:39.752308"]]
---
  def create
    entry_params = params["entry"].permit("title", :contents)
    entry = Entry.new(entry_params)
    if entry.save

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "entries" SET "title" = ?, "contents" = ?, "updated_at" = ? WHERE "entries"."id" = ?  [["title", "Day 4"], ["contents", "I'm stuck"], ["updated_at", "2018-03-06 18:04:54.060556"], ["id", 4]]
---
  def update
    entry_params = params[:entry].permit(:title, :contents)
    entry = Entry.find(params[:id])
    entry.update(entry_params)